app/Http/Controllers/ClientController.php

    public function index(ClientIndexRequest $request): View
    {
        $filters = $request->validated();
        $clients = Client::query()->with('owner');
        $clients = app(ClientFilters::class)->apply($clients, $filters);
        return view('clients.index', ['clients' => $clients->paginate(15)->withQueryString(), 'sources' => Source::all()]);
---
select * from "clients" where "clients"."deleted_at" is null limit 15 offset 0
select * from "sources" where "sources"."deleted_at" is null
select count(*) as aggregate from "clients" where "clients"."deleted_at" is null

    public function create(): View
    {
        return view('clients.create', ['sources' => Source::all()]);
---
select * from "sources" where "sources"."deleted_at" is null

    public function show(Client $client)
    {
        return view('clients.show', ['client' => $client, 'sources' => Source::all()]);
---
select * from "sources" where "sources"."deleted_at" is null

    public function edit(Client $client)
    {
        return view('clients.edit', ['client' => $client, 'sources' => Source::all()]);
---
select * from "sources" where "sources"."deleted_at" is null