app/Http/Controllers/DealsController.php

    public function index()
    {
        return view('deals.index', ['deals' => Deal::with('client', 'owner')->paginate(10)->withQueryString()]);
---
select * from "clients" where "clients"."id" in (3, 5, 9, 11, 22, 28, 53, 65, 76, 84) and "clients"."deleted_at" is null
select * from "deals" where "deals"."deleted_at" is null limit 10 offset 0
select count(*) as aggregate from "deals" where "deals"."deleted_at" is null

    public function update(Client $client, Deal $deal, DealsRequest $request)
    {
        $data = $request->validated();
        $deal->update($data);
---
update "deals" set "title" = 'test deals updated', "expected_close_at" = '2025-12-03 00:00:00', "updated_at" = '2025-12-23 05:53:00' where "id" = 1